Revit 2024 API
View.GetDepthCueing Method
 Returns the current depth cueing settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ViewDisplayDepthCueing GetDepthCueing()
Visual Basic
Public Function GetDepthCueing As ViewDisplayDepthCueing
Visual C++
public:
ViewDisplayDepthCueing^ GetDepthCueing()
Return Value
 Current depth cueing settings.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This view cannot use Depth Cueing
See Also
View Class
Autodesk.Revit.DB Namespace